SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/WV07LAVU28/RetrievePNRRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESD!ICESMSLB\/RES.LB!1541678835064!36791291!65537</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-11-08T06:07:32-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="CFVOTW"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESC!ICESMSLB\/RES.LB!1541679976263!36712754!589825</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="CFVOTW"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESC!ICESMSLB\/RES.LB!1541680356157!36840848!458753</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="CFVOTW"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESA!ICESMSLB\/RES.LB!1541680470554!36903840!393217</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="CFVOTW"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESD!ICESMSLB\/RES.LB!1541680502858!36959921!196609</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="CFVOTW"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESC!ICESMSLB\/RES.LB!1541680514333!36761638!589825</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="CFVOTW"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESE!ICESMSLB\/RES.LB!1541680563098!36894993!327681</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="CFVOTW"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope>